#Показать median_house_value где median_income < 2
#(Доп) Показать данные в первых 2 столбцах
#(Доп) Выбрать данные где housing_median_age < 20 и median_house_value > 70000

# Посмотреть все столбцы
c_h_t.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

# Задание
c_h_t.loc[c_h_t['median_income'] < 2, ['median_house_value']]

	median_house_value
5	67000.0
6	67000.0
16	181300.0
28	350000.0
43	79300.0
...	...
2943	57200.0
2964	91300.0
2985	109400.0
2986	85400.0
2995	225000.0
360 rows × 1 columns

# Доп_1
c_h_t[['longitude', 'latitude']]
longitude	latitude
0	-122.05	37.37
1	-118.30	34.26
2	-117.81	33.78
3	-118.36	33.82
4	-119.67	36.33
...	...	...
2995	-119.86	34.42
2996	-118.14	34.06
2997	-119.70	36.30
2998	-117.12	34.10
2999	-119.63	34.42
3000 rows × 2 columns

# Доп_2
c_h_t[(c_h_t['housing_median_age'] < 20) & (c_h_t['median_house_value'] > 70000)]
longitude	latitude	housing_median_age	total_rooms	total_bedrooms	population	households	median_income	median_house_value
4	-119.67	36.33	19.0	1241.0	244.0	850.0	237.0	2.9375	81700.0
7	-120.65	35.48	19.0	2310.0	471.0	1341.0	441.0	3.2250	166900.0
8	-122.84	38.40	15.0	3080.0	617.0	1446.0	599.0	3.6696	194400.0
13	-117.03	32.97	16.0	3936.0	694.0	1935.0	659.0	4.5625	231200.0
16	-120.81	37.53	15.0	570.0	123.0	189.0	107.0	1.8750	181300.0
...	...	...	...	...	...	...	...	...	...
2978	-121.34	38.64	17.0	2761.0	501.0	1128.0	482.0	3.7562	139700.0
2981	-120.66	35.49	17.0	4422.0	945.0	2307.0	885.0	2.8285	171300.0
2984	-117.59	33.88	13.0	3239.0	849.0	2751.0	813.0	2.6111	107000.0
2985	-120.47	34.94	17.0	1368.0	308.0	642.0	303.0	1.8633	109400.0
2991	-117.17	34.28	13.0	4867.0	718.0	780.0	250.0	7.1997	253800.0
792 rows × 9 columns

# Максимальное значение
print(df['population'].max())
# Минимальное значение
print(df['population'].min())
# Среднее значение
print(df['population'].mean())
# Сумма
print(df['population'].sum())
35682.0
3.0
1429.5739411764705
24302757.0

# Медианное значение
df[['population', 'total_rooms']].median()
population     1167.0
total_rooms    2127.0
dtype: float64

df.describe()
longitude	latitude	housing_median_age	total_rooms	total_bedrooms	population	households	median_income	median_house_value
count	17000.000000	17000.000000	17000.000000	17000.000000	17000.000000	17000.000000	17000.000000	17000.000000	17000.000000
mean	-119.562108	35.625225	28.589353	2643.664412	539.410824	1429.573941	501.221941	3.883578	207300.912353
std	2.005166	2.137340	12.586937	2179.947071	421.499452	1147.852959	384.520841	1.908157	115983.764387
min	-124.350000	32.540000	1.000000	2.000000	1.000000	3.000000	1.000000	0.499900	14999.000000
25%	-121.790000	33.930000	18.000000	1462.000000	297.000000	790.000000	282.000000	2.566375	119400.000000
50%	-118.490000	34.250000	29.000000	2127.000000	434.000000	1167.000000	409.000000	3.544600	180400.000000
75%	-118.000000	37.720000	37.000000	3151.250000	648.250000	1721.000000	605.250000	4.767000	265000.000000
max	-114.310000	41.950000	52.000000	37937.000000	6445.000000	35682.000000	6082.000000	15.000100	500001.000000